const books = [
  {
    id: "1",
    title: "Шестёрка воронов",
    author: "Ли Бардуго",
    year: 2015,
    description:
      "Команда из шести необычных преступников берётся за опасное и почти невозможное ограбление.",
  },
  {
    id: "2",
    title: "Тень и кость",
    author: "Ли Бардуго",
    year: 2012,
    description:
      "Девушка обнаруживает в себе редкую магическую силу, способную изменить судьбу целой страны.",
  },
  {
    id: "3",
    title: "Десять негритят",
    author: "Агата Кристи",
    year: 1939,
    description:
      "Десять незнакомцев оказываются на острове, где начинают происходить загадочные убийства.",
  },
  {
    id: "4",
    title: "Три товарища",
    author: "Эрих Мария Ремарк",
    year: 1936,
    description:
      "История дружбы, любви и надежды в Германии после Первой мировой войны.",
  },
  {
    id: "5",
    title: "Цветы для Элджернона",
    author: "Дэниел Киз",
    year: 1966,
    description:
      "История Чарли Гордона, который участвует в эксперименте по повышению интеллекта.",
  },
  {
    id: "6",
    title: "Дом странных детей",
    author: "Ренсом Риггз",
    year: 2011,
    description:
      "Подросток находит загадочный дом, в котором живут дети с необычными способностями.",
  },
  {
    id: "7",
    title: "Девушка в поезде",
    author: "Пола Хокинс",
    year: 2015,
    description:
      "Женщина каждый день наблюдает за чужой жизнью из окна поезда и становится частью тайны.",
  },
  {
    id: "8",
    title: "Виноваты звёзды",
    author: "Джон Грин",
    year: 2012,
    description:
      "История двух подростков, которые встречаются в группе поддержки и влюбляются друг в друга.",
  },
];

function delay(data) {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(data);
    }, 1000);
  });
}

export function getBooks() {
  return delay(books);
}

export async function getBook(id) {
  await delay(null);
  return books.find((book) => book.id === id);
}
